test_cases/base_case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-6;
        relTol           0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor   yes;
    transonic           no;
    nOuterCorrectors    20;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;
    consistent          yes;
    pRefCell     0;
    pRefValue    0;

    residualControl
    {
        U
        {
            relTol          0;
            tolerance       0.0001;
        }
	p
	{
	    relTol          0;
	    tolerance       0.001;
	}
    }
}


// ************************************************************************* //
